{
  "courses": [
    {
      "id": "1",
      "title": "Frontend Development",
      "subtitle": "Crafting designs that enhance user interaction, deliver intuitive experiences, and adapt seamlessly across devices.",
      "monthone": 120000,
      "monthtwo": 160000,
      "monththree": 220000,
      "instructor": "Olamide",
      "lessons": "4",
      "image": "course-img1.jpg",
      "durationone": "3 months",
      "durationtwo": "6 months",
      "durationthree": "9 months",
      "lessonone": "7",
      "lessontwo": "24",
      "lessonthree": "32",
      "description": "This course covers the essentials of building responsive and interactive web interfaces using HTML, CSS, and JavaScript. Students will learn about user experience (UX) design principles and how to implement modern frameworks such as React or Vue.js. The curriculum includes hands-on projects that simulate real-world scenarios, allowing students to apply their skills in creating dynamic web applications.",
      "targetAudience": [
        {
          "group": "Beginners in Web Development",
          "description": "Individuals with little to no prior experience in coding or web design who want to start their journey in building websites and web applications."
        },
        {
          "group": "Aspiring Web Designers",
          "description": "Creative professionals looking to enhance their skills in designing user interfaces (UIs) and user experiences (UX). This course will help them understand how to turn their designs into functional web applications."
        },
        {
          "group": "Current Developers Seeking to Upskill",
          "description": "Developers who have experience in backend development or other programming areas but want to broaden their skill set by learning frontend technologies like HTML, CSS, and JavaScript."
        },
        {
          "group": "Students in Computer Science or Related Fields",
          "description": "College or university students pursuing degrees in computer science, information technology, or digital media who want practical skills to complement their academic learning."
        },
        {
          "group": "Professionals in Digital Marketing or Product Management",
          "description": "Individuals working in digital marketing, product management, or project management who need to understand frontend development concepts to collaborate effectively with development teams."
        },
        {
          "group": "Entrepreneurs and Business Owners",
          "description": "Business owners or entrepreneurs who want to create and manage their websites or web applications without relying solely on external developers. This knowledge empowers them to make informed decisions about their web presence."
        },
        {
          "group": "Career Changers",
          "description": "Professionals from non-technical backgrounds looking to transition into technology and web development. This course provides foundational knowledge and practical skills to facilitate that change."
        }
      ]
    },
    {
      "id": "2",
      "title": "Backend Development",
      "subtitle": "Building robust systems with efficient data handling, secure user authentication, and seamless integrations for performance.",
      "monthone": 500,
      "monthtwo": 500,
      "monththree": 500,
      "instructor": "Jane Doe",
      "lessons": "5",
      "image": "course-img2.jpg",
      "durationone": "3 months",
      "durationtwo": "6 months",
      "durationthree": "9 months",
      "lessonone": "10",
      "lessontwo": "20",
      "lessonthree": "30",
      "description": "This course provides an in-depth understanding of backend development, focusing on server-side programming, database management, and API design. Students will learn to build and maintain the technology that powers the client-side of applications, ensuring data integrity and security while delivering high performance. The curriculum includes practical exercises that prepare students for real-world backend development challenges.",
      "targetAudience": [
        {
          "group": "Beginners in Programming",
          "description": "Individuals who have minimal programming experience but are eager to learn the fundamentals of server-side development."
        },
        {
          "group": "Aspiring Backend Developers",
          "description": "Those who wish to specialize in backend development and understand the principles of building and managing server-side applications."
        },
        {
          "group": "Developers Seeking to Expand Skills",
          "description": "Frontend developers or those in other programming roles looking to gain knowledge of backend technologies and frameworks."
        },
        {
          "group": "Computer Science Students",
          "description": "Students pursuing degrees in computer science or software engineering who want to enhance their understanding of backend architecture and design."
        },
        {
          "group": "Tech Professionals",
          "description": "Individuals working in IT or related fields who wish to deepen their knowledge of backend systems to enhance their career prospects."
        },
        {
          "group": "Entrepreneurs",
          "description": "Business owners interested in understanding backend processes to better manage their web applications and software products."
        },
        {
          "group": "Career Switchers",
          "description": "Professionals from non-technical backgrounds looking to transition into backend development and the tech industry."
        }
      ]
    },
    {
      "id": "3",
      "title": "Fullstack Development",
      "subtitle": "Developing applications that combine user-centric interfaces and effective server logic for seamless, end-to-end experiences.",
      "monthone": 600,
      "monthtwo": 800,
      "monththree": 1000,
      "instructor": "Alice Johnson",
      "lessons": "6",
      "image": "course-img3.jpg",
      "durationone": "3 months",
      "durationtwo": "6 months",
      "durationthree": "9 months",
      "lessonone": "8",
      "lessontwo": "25",
      "lessonthree": "35",
      "description": "This course offers a comprehensive introduction to fullstack development, covering both frontend and backend technologies. Students will learn to build complete web applications from the ground up, gaining expertise in server-side programming, database management, and user interface design. The curriculum includes real-world projects that enable students to create functional applications while mastering essential frameworks and tools.",
      "targetAudience": [
        {
          "group": "Aspiring Fullstack Developers",
          "description": "Individuals interested in becoming fullstack developers who wish to learn both frontend and backend skills."
        },
        {
          "group": "Current Developers",
          "description": "Frontend or backend developers looking to expand their skill set to include both sides of web development."
        },
        {
          "group": "Tech Students",
          "description": "Students pursuing degrees in computer science, software engineering, or related fields who want to acquire practical fullstack development skills."
        },
        {
          "group": "Entrepreneurs",
          "description": "Business owners wanting to understand the entire web development process to effectively manage their projects."
        },
        {
          "group": "Career Changers",
          "description": "Professionals from various backgrounds looking to transition into tech and gain a versatile skill set in web development."
        },
        {
          "group": "Tech Enthusiasts",
          "description": "Individuals passionate about technology who want to gain a holistic view of web development."
        }
      ]
    },
    {
      "id": "4",
      "title": "Data Analysis",
      "subtitle": "Analyzing data trends, creating visual insights, and leveraging predictive models to enable strategic decision-making.",
      "monthone": 500,
      "monthtwo": 500,
      "monththree": 500,
      "image": "course-img2.jpg",
      "description": "This course provides a comprehensive overview of data analysis techniques, focusing on how to interpret complex data sets and derive actionable insights. Students will learn to use popular data analysis tools and programming languages such as Python and R, as well as data visualization tools like Tableau and Power BI. The curriculum includes hands-on projects that help students apply their analytical skills to real-world data scenarios.",
      "targetAudience": [
        {
          "group": "Aspiring Data Analysts",
          "description": "Individuals looking to start a career in data analysis and gain the skills needed to interpret and analyze data effectively."
        },
        {
          "group": "Business Professionals",
          "description": "Professionals in marketing, finance, and other fields who want to leverage data analysis to make informed business decisions."
        },
        {
          "group": "Students in Related Fields",
          "description": "Students studying statistics, data science, or business who want to enhance their understanding of data analysis techniques."
        },
        {
          "group": "Entrepreneurs",
          "description": "Business owners who wish to use data analysis to inform their business strategies and improve operational efficiency."
        },
        {
          "group": "Career Changers",
          "description": "Individuals from non-technical backgrounds looking to transition into data analysis roles in the tech industry."
        },
        {
          "group": "Tech Enthusiasts",
          "description": "Individuals interested in data science and analytics who want to learn how to work with data effectively."
        }
      ]
    },
    {
      "id": "5",
      "title": "Artificial Intelligence",
      "subtitle": "Applying machine learning and vision to develop technologies that mimic cognition, drive innovation, and assist decisions.",
      "monthone": 500,
      "monthtwo": 500,
      "monththree": 500,
      "image": "course-img2.jpg"
    },
    {
      "id": "6",
      "title": "Cyber Security",
      "subtitle": "Ensuring privacy, trust, and data protection with strategies and measures that safeguard sensitive information online.",
      "monthone": 500,
      "monthtwo": 500,
      "monththree": 500,
      "image": "course-img2.jpg"
    }
  ],
  "students": [
    {
      "id": "4d12",
      "title": "Frontend Development",
      "name": "Nwanoroh Chidera",
      "email": "d@gmail.com",
      "phone": "12345678",
      "gender": "Female",
      "dob": "2024-10-25",
      "address": "Ixora Park Estate",
      "city": "LEKKI-IKATE ELEGUSHI",
      "state": "Lagos",
      "nationality": "noigrhw",
      "educationLevel": "High School",
      "duration": "9 months",
      "reason": "ESgn "
    },
    {
      "id": "tjh8rhfeu",
      "title": "Backend Development",
      "name": "Nwanoroh Chidera",
      "email": "d@gmail.com",
      "phone": "123243567",
      "gender": "Female",
      "dob": "2001-09-30",
      "address": "Ixora Park Estate",
      "city": "LEKKI-IKATE ELEGUSHI",
      "state": "Lagos",
      "nationality": "nigerian",
      "educationLevel": "OND",
      "duration": "3-months",
      "reason": "money must be amde"
    },
    {
      "id": "9q7orqznj",
      "title": "Artifical Intelligent",
      "name": "Angelo chukwujekwu",
      "email": "angechu@gmail.com",
      "phone": "09067489787",
      "gender": "Male",
      "dob": "1993-10-10",
      "address": "zen garden idumota",
      "city": "lagos island",
      "state": "Lagos",
      "nationality": "Korean",
      "educationLevel": "Masters",
      "duration": "9 months",
      "reason": "omo boys need monry scatter i believ this would help me"
    },
    {
      "id": "k7tm6hl5e",
      "title": "Frontend Development",
      "name": "Matilda John",
      "email": "mj@gmail.com",
      "phone": "08033221935",
      "gender": "Female",
      "dob": "1998-10-20",
      "address": "12 olod jami street",
      "city": "orile",
      "state": "lagos",
      "nationality": "Nigerian",
      "educationLevel": "HND",
      "duration": "6 months",
      "reason": "jjk"
    },
    {
      "id": "",
      "title": "Frontend Development",
      "name": "Nwanoroh Chidera",
      "email": "b@gmail.com",
      "phone": "2345678",
      "gender": "Female",
      "dob": "2024-10-09T21:01:00.000Z",
      "address": "Ixora Park Estate",
      "city": "LEKKI-IKATE ELEGUSHI",
      "state": "Lagos",
      "nationality": "jkl;",
      "educationLevel": "Degree",
      "duration": "6-months",
      "reason": "fghjkl"
    },
    {
      "id": "",
      "title": "Backend Development",
      "name": "Nwanoroh Chidera",
      "email": "g@gmail.com",
      "phone": "09876543",
      "gender": "Female",
      "dob": "2024-11-11T21:02:00.000Z",
      "address": "Ixora Park Estate",
      "city": "LEKKI-IKATE ELEGUSHI",
      "state": "Lagos",
      "nationality": "nqe",
      "educationLevel": "OND",
      "duration": "6-months",
      "reason": "ghbjnkm"
    }
  ]
}